01  WS-AREA. 
    05  WS-NUMBER PIC 9(5) VALUE 0. 
    05  WS-CHAR PIC X VALUE 'A'.

PROCEDURE DIVISION.
    ADD 1 TO WS-NUMBER.
    DISPLAY 'NUMBER: ' WS-NUMBER.
    IF WS-NUMBER > 5
        GO TO END-PARA.
    END-IF
    MOVE 'B' TO WS-CHAR
    DISPLAY 'CHAR: ' WS-CHAR
    GO TO CONTINUE-PARA.
END-PARA. 
    STOP RUN.
CONTINUE-PARA.
    GO TO PROCEDURE-DIVISION.