01  WS-AREA. 
    05  WS-NUMBER PIC 9(5) VALUE 0. 
    05  WS-CHAR PIC X VALUE 'A'.

PROCEDURE DIVISION.
    PERFORM UNTIL WS-NUMBER > 5
        ADD 1 TO WS-NUMBER
        DISPLAY 'NUMBER: ' WS-NUMBER
        IF WS-NUMBER < 5
            MOVE 'B' TO WS-CHAR
            DISPLAY 'CHAR: ' WS-CHAR
        END-IF
    END-PERFORM
    STOP RUN.